# RadiansPerSecond Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..RadiansPerSecond Property
UnitTypeId Class See Also
---
Radians per second.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId RadiansPerSecond { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RadiansPerSecond As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RadiansPerSecond {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace